# (Ці категорії бачить тільки Адмін в меню додавання теми в базу данних.)
# Тут можна додати категорію для тем які ви додаєте до каталогу. 
# Категорія записується в середині фігурних дужок {}
# Запис категорії має виглядати так: 'Ігри': 'cat_1',
# Перша частина це те, що буде відображатися користувачеві бота і має бути записано в лапках таких "" або таких ''
# друга частина це ідентифікатор категорії для бота, теж записується в лапках за тим же принципом,
# але ідентифікатор має починатися з cat_ та закінчуватися цифрою, цифра має бути унікальною, не має бути двох однакових ідентифікаторів,
# наприклад cat_1 і cat_1, або cat_23 і cat_23.

# Важливо !!! Якщо категорія вже була додана до бота і до цієї категорії додано запис в базу данних, НЕ МОЖНА ВИДАЛЯТИ ЦЮ КАТЕГОРІЮ !!! 
# Якщо категорія більше вам непотрібна то просто поставте перед нею символ: # це зробить її невидимою для бота.
# Ось приклад: #'Ігри': 'cat_1', 
# Після цього ця категорія не буде доступна для користувачів чи адміністратора для взаємодії з нею з бота. 
# А також не використовуйте надалі цифру з такої "невидимої" категорії для нової категорії. 
# Тобто якщо ви зробили ось так: #'Ігри': 'cat_1', то жодна інша категорія не має містити цифру 1 в ідентифікаторі. 
# Якщо прибрати символ # у невидимої категорії то вона знову стане доступною.
# Це може бути корисно для сезонних тем (на Хелловін чи Новорічних).
CATEGORIES = {
    'Ігри': 'cat_1',
    'Фільми': 'cat_2',
    'Аніме': 'cat_3',
    'Автомобілі': 'cat_4',
    'Мото': 'cat_5',
    'НГ': 'cat_6',
    'Темні': 'cat_7',
}

# (Ці категорії бачать користувачі в меню Каталог тем.)
# Тут можна додати категорію для тем які ви отримуєте з каталогу.
# Категорія записується в середині фігурних дужок {}
# Тобто якщо у вас є категорія 'Ігри': 'cat_1', у CATEGORIES то такаж категорія має бути і в CATEGORIES_GET, 
# але її ідентифікатор на початку повинен мати db-get- 
# Наприклад якщо ваша категорія 'Ігри': 'cat_1', у CATEGORIES, то в CATEGORIES_GET вона матиме вигляд 'Ігри': 'db-get-cat_1', 

# Примітка! У CATEGORIES_GET розміщайте тільки ті категорії із CATEGORIES які ви хочете щоб бачив користувач. 
# Наприклад якщо ви додаєте нову категорію і не хочете, щоб користувачі її бачили бо ви ще не наповнили темами цю категорію,
# то не додавайте її до CATEGORIES_GET

# Якщо категорія більше вам не потрібна, але для цієї категорі є записи в базі банних то зробіть її "невидимою"
# як в описі до CATEGORIES, але не видаляйте її.
CATEGORIES_GET = {
    'Ігри': 'db-get-cat_1',
    'Фільми': 'db-get-cat_2',
    'Аніме': 'db-get-cat_3',
    'Автомобілі': 'db-get-cat_4',
    'Мото': 'db-get-cat_5',
    'НГ': 'db-get-cat_6',
    'Темні': 'db-get-cat_7',
}

# (Ці категорії бачить тільки Адмін в меню додавання мови в базу данних.)
# Тут можна додати категорію для мов які ви додаєте до каталогу.
# Категорія записується в середині фігурних дужок {}
# Запис категорії має виглядати так: 'Ігри': 'lang_cat_1', 
# Всі правила аналогічні попереднім як в описі до CATEGORIES
CATEGORIES_LANGUAGES = {
    'Ігри': 'lang_cat_1',
    'Фільми': 'lang_cat_2',
    'Аніме': 'lang_cat_3',
    'Автомобілі': 'lang_cat_4',
    'Мото': 'lang_cat_5',
    'НГ': 'lang_cat_6',
    'Темні': 'lang_cat_7',
}

# (Ці категорії бачать користувачі в меню Каталог мов.)
# Тут можна додати категорію для мов які ви отримуєте з каталогу.
# Категорія записується в середині фігурних дужок {}
# Запис категорії має виглядати так: 'Ігри': 'lang_cat_get_1', тобто якщо у вас в CATEGORIES_LANGUAGES є 
# категорія 'Аніме': 'lang_cat_3', то в CATEGORIES_LANGUAGES_GET ця категорія має виглядати 'Аніме': 'lang_cat_get_3', 
# в ідентифікатор категорії додається get_ між lang_cat_ і цифрою.
# Всі правила аналогічні попереднім як в описі до CATEGORIES_GET
CATEGORIES_LANGUAGES_GET = {
    'Ігри': 'lang_cat_get_1',
    'Фільми': 'lang_cat_get_2',
    'Аніме': 'lang_cat_get_3',
    'Автомобілі': 'lang_cat_get_4',
    'Мото': 'lang_cat_get_5',
    'НГ': 'lang_cat_get_6',
    'Темні': 'lang_cat_get_7',
}

# Нічого не міняти !!!
DRVICES = {
    'Андроид': 'db-dev_android',
    'Компьютер': 'db-dev_pc',
    'iPhone': 'db-dev_ios',
}

# Нічого не міняти !!!
DRVICES_GET = {
    'Андроид': 'db-get-device_android',
    'Компьютер': 'db-get-device_pc',
    'iPhone': 'db-get-device_ios',
}

# Нічого не міняти !!!
DRVICES_LANGUAGES_GET = {
    'Андроид': 'dev_lang_get_android',
    'Компьютер': 'dev_lang_get_computer',
    'iPhone': 'dev_lang_get_ios',
}
