START_COMMAND_DESCRIPTION = 'Почати роботу з ботом.'
MESSAGE_ON_START_COMMAND = 'Бот готовий до роботи!\nВідправте фото щоб зробити з нього темку!'
MESSAGE_ON_CREATE_THEME = 'Відправте мені картинку і я зроблю із неї тему для Telegram'
MESSAGE_ON_ADD_TO_CHAT = 'Текст про те як додати бота до групи'
MESSAGE_ON_FAQ = """
Питання, що частіше всього виникають:

<a href="https://telegra.ph/Test-title-12-14-6">Питання 1</a>
<a href="https://telegra.ph/Test-title-2-12-14">Питання 2</a>

По іншим питанням до <a href="https://t.me/Grimnebuulen">адміністратора</a>
"""
MESSAGE_WITH_CHAT = 'Канал: '
MESSAGE_CHECK_SUBSCRIBE = 'Перевірити підписку'
MESSAGE_YOU_NOT_SUBSCRIBE = 'Ви не підписані на канали, для користування ботом підпишіться на канали:'
SUBSCRIBE_CHECKED = 'Бот готовий до роботи, відправте йому фото.'
WAIT_MESSAGE = 'Проводжу аналіз зображення ⏳'
NOT_IMAGE = 'ОЙ, здається це не фото 🤨🧐\nПеревірте файл, що ви відправили!'

BUTTON_CREATE_THEME = 'Створити тему'
BUTTON_ADD_TO_CHAT = 'Додати бота в чат'
BUTTON_THEME_CATALOG = 'Каталог тем'
BUTTON_FONTS_CATALOG = 'Каталог шрифтів'
BUTTON_FAQ = '❓ F.A.Q'
BUTTON_ADMIN = 'Адмінка'
MESSAGE_ON_ADMIN = 'Права адміна підтверджено!'

BUTTON_ADD_THEME = 'Додати тему'
BUTTON_ADD_FONT = 'Додати шрифт'
BUTTON_BACK_TO_USER_KB = 'Клавіатура юзера'
MESSAGE_ON_BACK_TO_USER_KB = 'Клавіатура юзера!'
BUTTON_NEXT_THEMES = 'Наступні 5 тем'

BUTTON_ADD_BOT_TO_CHAT = 'Додати бота до групи'

CHOOSE_DEVICE_TEXT = '1️⃣ Оберіть ваш пристрій: 📱'
ANDROID = 'Android'
IPHONE = 'IPhone'
PC = "Комп'ютер [Windows/Linux]"
ABORT = 'Відмінити'

CHOOSE_BACKGROUND_COLOR_TEXT = '2️⃣ Оберіть колір фону:'
BUTTON_1 = '1'
BUTTON_2 = '2'
BUTTON_3 = '3'
BUTTON_4 = '4'
BUTTON_5 = '5'
BUTTON_WHITE = 'Білий'
BUTTON_BLACK = 'Чорний'
BUTTON_AUTO = 'Авто'
BUTTON_BACK = '⬅️ Назад'

CHOOSE_PRIMARY_COLOR_TEXT = '3️⃣ Оберіть колір для основного тексту:'
CHOOSE_SECONDARY_COLOR_TEXT = '4️⃣ Оберіть колір для не основного тексту:'
CHOOSE_ALFA = '5️⃣ Оберіть прозорість для повідомлень:'
BUTTON_ALFA_10 = '10%'
BUTTON_ALFA_20 = '20%'
BUTTON_ALFA_30 = '30%'
BUTTON_ALFA_40 = '40%'
BUTTON_ALFA_50 = '50%'
BUTTON_ALFA_60 = '60%'
BUTTON_ALFA_70 = '70%'
BUTTON_ALFA_80 = '80%'
BUTTON_ALFA_90 = '90%'
BUTTON_ALFA_0 = 'Без прозорості'

MESSAGE_THEME_DONE = 'Тема зроблена в @Grimm_Python_Test_Bot\n⚠️⚠️⚠️\nПерезавантажте Телеграм для того, щоб тема встановилась повністю.\n⚠️⚠️⚠️'

MESSAGE_ADDED_TO_DB = 'Тему додано до каталогу'

MESSAGE_SEND_PREVIEW_THEME = 'Скиньте мені прев`ю для теми'
MESSAGE_SEND_THEME_FILE = 'Скиньте мені файл теми'
MESSAGE_CHOICE_CATEGORY = 'Оберіть категорію'
MESSAGE_CHOICE_DEVICE = 'Для якого девайса тема?'
MESSAGE_IS_NOT_THEME = 'Це не файл теми!'
MESSAGE_NO_PREVIEW_IN_THEME = 'У теми немає превю! Скиньте превю для теми!'

MESSAGE_OUR_THEMES = 'Ось теми що у нас є'
MESSAGE_ON_BACK = 'Головне меню'
DIVIVER = '🟢🟢🟢🟢🟢🟢🟢🟢🟢🟢🟢'

MESSAGE_NO_MORE_THEMES = 'Ой! здається теми закінчилися!'
MESSAGE_NO_THEMES_IN_CATALOG = 'Ой! здається тем за такими параметрами у нас немає!'
